OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0_59ac345/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_aead_ccm.c
// AES CCM - Custom test vector 5 - Invalid behavior test for AES key.
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_ccm_128_inv_c22) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_128_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 128 Decrypt with invalid AES key",
    .p_plaintext            = "08090a0b0c0d0e0f101112131415161718191a1b1c1d1e",
    .p_ciphertext           = "588c979a61c663d2f066d0c2c0f989806d5f6b61dac384",
    .p_key                  = "d0c1c2c3c4c5c6c7c8c9cacbcccdcecf",
    .p_ad                   = "0001020304050607",
    .p_nonce                = "00000003020100a0a1a2a3a4a5",
    .p_mac                  = "17e8d12cfdf926e0"
};

// AES CCM - Custom test vector 6 - Invalid behavior test for AES nonce.
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_ccm_128_inv_c23) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 128 Encrypt with invalid AES nonce",
    .p_plaintext            = "08090a0b0c0d0e0f101112131415161718191a1b1c1d1e",
    .p_ciphertext           = "588c979a61c663d2f066d0c2c0f989806d5f6b61dac384",
    .p_key                  = "c0c1c2c3c4c5c6c7c8c9cacbcccdcecf",
    .p_ad                   = "0001020304050607",
    .p_nonce                = "10000003020100a0a1a2a3a4a5",
    .p_mac                  = "17e8d12cfdf926e0"
};

// AES CCM - Custom test vector 7 - Invalid behavior test for AES nonce.
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_ccm_128_inv_c24) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_128_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 128 Decrypt with invalid AES nonce",
    .p_plaintext            = "08090a0b0c0d0e0f101112131415161718191a1b1c1d1e",
    .p_ciphertext           = "588c979a61c663d2f066d0c2c0f989806d5f6b61dac384",
    .p_key                  = "c0c1c2c3c4c5c6c7c8c9cacbcccdcecf",
    .p_ad                   = "0001020304050607",
    .p_nonce                = "10000003020100a0a1a2a3a4a5",
    .p_mac                  = "17e8d12cfdf926e0"
};

// AES CCM - Custom test vector 8
NRF_SECTION_ITEM_REGISTER(test_vector_aead_data, test_vector_aead_t test_vector_aes_ccm_128_c8) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 128 message_len=250 ad_len=8 mac_len=8 nonce_len=13",
    .p_plaintext            = "e96325847ce207c2bf6638a52634075139998888fa0ca1501a4b57ee0767210f1fee065b7ed1e4005fe1c3ec482b2d3cad3d8461d4ab2ba1c73cbe2c65ac8b1e61be3f052ecadf671a3f58601ec0f1ac95367dae85601449f434b9d10757a613784a229aa14bebe6ed07579ec0a513ce7ce799d1e6cd468613f0d3f42e6162680b28f13aeb826572934424459137bd3aabec437bf4fdff007d2675d7fd2195280da092eb1b3549e5457e065cc47349f2c3013b8a4a1938b05c033b2a5b6b477be39b415f4f50beac41f817783bda28f24bab3c8095e1b01e48ce4271cd2a323d1d8c100bb9856f75f63bdee34510de01e32efc0b12e980e9161a",
    .p_ciphertext           = "5f58855b5dce6c704a380d36e1ae8e5fbdd1103edb5afebf74c434fcdcab346f3b2219c0afe77e355464c32626336dc1a7909942548cf23f89e5eba4dba14af9c6c0eca4099a1a962d0fe3d8aaf64f050fc5fdd04228bde4d35a8601a975c0dbdb1d30fea3b7d9648a2666e521195e1e2a2ac811855dca78cc1941709d54cf2a1d8327de81ed4dfe024db1efb8975ba7e61855e3729b11bdba502bc59039b6446957473b362015e88c7403ddd3dfd3e2eb88a4232a32bf5f23d5e91d2abbaae4d549b23e2bacb75cc332edecce7492fc5e009986f925ceef99ea6d72fc97cfb5720302be8d6deaf9a1038c90d1ba3973b7e045cf3330579c7a21",
    .p_key                  = "7e376f9b5227648a72f52df8437c0d36",
    .p_ad                   = "4bf9a35147f3b430",
    .p_nonce                = "43925318850a09c9fb23247cbd",
    .p_mac                  = "fa070211947a3af3"
};

// AES CCM - Custom test vector 9
NRF_SECTION_ITEM_REGISTER(test_vector_aead_data, test_vector_aead_t test_vector_aes_ccm_128_c9) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 128 message_len=16 ad_len=250 mac_len=8 nonce_len=13",
    .p_plaintext            = "08090a0b0c0d0e0f101112131415161718191a1b1c1d1e",
    .p_ciphertext           = "be32aad42d2165bde54f2780d38f9f199c5182ad3d4b41",
    .p_key                  = "7e376f9b5227648a72f52df8437c0d36",
    .p_ad                   = "0ee0089ec32c7cfa036bd1ab9c23b98cd5d166214d61c719688c6a0ecff705da47ac179cae7eaa3b638ab022a6669729fe47f24679e78488125d989cc7d1bbd8b472b04678b45adde4cca92cd91c4e214257243b163eca04bf643e9df6f7c5bf55aa91bc348154b5c3e9529a56fed8b04e0726b6de3ecc43f499108933e07297bdfcd4d8df2aa9af908083aeccc5c23fe9efbbf5fa9a27ea2923d36188197c87c955fcc5f7e0ebff4b01ebf008a5c93dab12ddfbf65f4225e5a3dfd44e36dbc3ba7891fce514d127e5eb8adb939670b4c5643c46425c614546b90cf0d720203bef4a12ff2d766623c92e134420e3b423b526598f32e8884843bc",
    .p_nonce                = "43925318850a09c9fb23247cbd",
    .p_mac                  = "64f4f8957d6b69e3"
};


// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 128 - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_128_encrypt_0) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 128 Encrypt message_len=0 ad_len=0 mac_len=4 nonce_len=7 valid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "4ae701103c63deca5b5a3939d7d05992",
    .p_ad                   = "",
    .p_nonce                = "5a8aa485c316e9",
    .p_mac                  = "02209f55"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 128 - Count 1
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_128_encrypt_1) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 128 Encrypt message_len=0 ad_len=0 mac_len=4 nonce_len=7 invalid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "4ae701103c63deca5b5a3939d7d05992",
    .p_ad                   = "",
    .p_nonce                = "3796cf51b87266",
    .p_mac                  = "9a04c241"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 128 - Count 2
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_128_encrypt_2) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 128 Encrypt message_len=0 ad_len=0 mac_len=4 nonce_len=7 invalid 2",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "4ae701103c63deca5b5a3939d7d05992",
    .p_ad                   = "",
    .p_nonce                = "89ca5a64050f9f",
    .p_mac                  = "f5f915df"
};


// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 128 - Count 15
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_128_encrypt15) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 128 Encrypt message_len=0 ad_len=0 mac_len=16 nonce_len=7 valid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "4bb3c4a4f893ad8c9bdc833c325d62b3",
    .p_ad                   = "",
    .p_nonce                = "5a8aa485c316e9",
    .p_mac                  = "75d582db43ce9b13ab4b6f7f14341330"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 128 - Count 16
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_128_encrypt16) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 128 Encrypt message_len=0 ad_len=0 mac_len=16 nonce_len=7 invalid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "4bb3c4a4f893ad8c9bdc833c325d62b3",
    .p_ad                   = "",
    .p_nonce                = "3796cf51b87266",
    .p_mac                  = "3a65e03af37b81d05acc7ec1bc39deb0"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 128 - Count 17
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_128_encrypt17) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 128 Encrypt message_len=0 ad_len=0 mac_len=16 nonce_len=7 invalid 2",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "4bb3c4a4f893ad8c9bdc833c325d62b3",
    .p_ad                   = "",
    .p_nonce                = "89ca5a64050f9f",
    .p_mac                  = "efc5721e0b9e4c3c90deab0e1d5c11bd"
};

