OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0_59ac345/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_aead_ccm.c
// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 128 - Count 16
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_128_decrypt16) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_128_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 128 Decrypt message_len=0 ad_len=0 mac_len=16 nonce_len=7 invalid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "4bb3c4a4f893ad8c9bdc833c325d62b3",
    .p_ad                   = "",
    .p_nonce                = "3796cf51b87266",
    .p_mac                  = "3a65e03af37b81d05acc7ec1bc39deb0"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 128 - Count 17
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_128_decrypt17) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_128_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 128 Decrypt message_len=0 ad_len=0 mac_len=16 nonce_len=7 invalid 2",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "4bb3c4a4f893ad8c9bdc833c325d62b3",
    .p_ad                   = "",
    .p_nonce                = "89ca5a64050f9f",
    .p_mac                  = "efc5721e0b9e4c3c90deab0e1d5c11bd"
};


// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 128 - Count 30
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_128_decrypt30) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 128 Decrypt message_len=0 ad_len=0 mac_len=4 nonce_len=13 valid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "4bb3c4a4f893ad8c9bdc833c325d62b3",
    .p_ad                   = "",
    .p_nonce                = "5a8aa485c316e9403aff859fbb",
    .p_mac                  = "90156f3f"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 128 - Count 31
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_128_decrypt31) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_128_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 128 Decrypt message_len=0 ad_len=0 mac_len=4 nonce_len=13 invalid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "4bb3c4a4f893ad8c9bdc833c325d62b3",
    .p_ad                   = "",
    .p_nonce                = "a16a2e741f1cd9717285b6d882",
    .p_mac                  = "88909016"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 128 - Count 32
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_128_decrypt32) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_128_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 128 Decrypt message_len=0 ad_len=0 mac_len=4 nonce_len=13 invalid 2",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "4bb3c4a4f893ad8c9bdc833c325d62b3",
    .p_ad                   = "",
    .p_nonce                = "368f3b8180fd4b851b7b272cb1",
    .p_mac                  = "de547d03"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 128 - Count 45
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_128_decrypt45) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 128 Decrypt message_len=0 ad_len=0 mac_len=16 nonce_len=13 valid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "19ebfde2d5468ba0a3031bde629b11fd",
    .p_ad                   = "",
    .p_nonce                = "5a8aa485c316e9403aff859fbb",
    .p_mac                  = "fb04dc5a44c6bb000f2440f5154364b4"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 128 - Count 46
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_128_decrypt46) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_128_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 128 Decrypt message_len=0 ad_len=0 mac_len=16 nonce_len=13 invalid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "19ebfde2d5468ba0a3031bde629b11fd",
    .p_ad                   = "",
    .p_nonce                = "a16a2e741f1cd9717285b6d882",
    .p_mac                  = "5447075bf42a59b91f08064738b015ab"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 128 - Count 47
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_128_decrypt47) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_128_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 128 Decrypt message_len=0 ad_len=0 mac_len=16 nonce_len=13 invalid 2",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "19ebfde2d5468ba0a3031bde629b11fd",
    .p_ad                   = "",
    .p_nonce                = "368f3b8180fd4b851b7b272cb1",
    .p_mac                  = "fdc992847f0815fac67aa935b35208ed"
};


// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 128 - Count 60
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_128_decrypt60) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 128 Decrypt message_len=24 ad_len=0 mac_len=4 nonce_len=7 valid 1",
    .p_plaintext            = "3796cf51b8726652a4204733b8fbb047cf00fb91a9837e22",
    .p_ciphertext           = "a90e8ea44085ced791b2fdb7fd44b5cf0bd7d27718029bb7",
    .p_key                  = "19ebfde2d5468ba0a3031bde629b11fd",
    .p_ad                   = "",
    .p_nonce                = "5a8aa485c316e9",
    .p_mac                  = "03e1fa6b"
};

