OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0_59ac345/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_aead_ccm.c
// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 128 - Count 61
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_128_decrypt61) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_128_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 128 Decrypt message_len=24 ad_len=0 mac_len=4 nonce_len=7 invalid 1",
    .p_plaintext            = "3796cf51b8726652a4204733b8fbb047cf00fb91a9837e22",
    .p_ciphertext           = "50aafe0578c115c4a8e126ff7b3ccb64dce8ccaa8ceda69f",
    .p_key                  = "19ebfde2d5468ba0a3031bde629b11fd",
    .p_ad                   = "",
    .p_nonce                = "31f8fa25827d48",
    .p_mac                  = "23e5d81c"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 128 - Count 62
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_128_decrypt62) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_128_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 128 Decrypt message_len=24 ad_len=0 mac_len=4 nonce_len=7 invalid 2",
    .p_plaintext            = "3796cf51b8726652a4204733b8fbb047cf00fb91a9837e22",
    .p_ciphertext           = "512ed208bf10d57406537e94d20a5b6e2e9ab0683dfdc685",
    .p_key                  = "19ebfde2d5468ba0a3031bde629b11fd",
    .p_ad                   = "",
    .p_nonce                = "5340ed7752c9ff",
    .p_mac                  = "869a97f0"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 128 - Count 75
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_128_decrypt75) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 128 Decrypt message_len=24 ad_len=0 mac_len=16 nonce_len=7 valid 1",
    .p_plaintext            = "3796cf51b8726652a4204733b8fbb047cf00fb91a9837e22",
    .p_ciphertext           = "24ab9eeb0e5508cae80074f1070ee188a637171860881f1f",
    .p_key                  = "197afb02ffbd8f699dacae87094d5243",
    .p_ad                   = "",
    .p_nonce                = "5a8aa485c316e9",
    .p_mac                  = "2d9a3fbc210595b7b8b1b41523111a8e"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 128 - Count 76
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_128_decrypt76) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_128_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 128 Decrypt message_len=24 ad_len=0 mac_len=16 nonce_len=7 invalid 1",
    .p_plaintext            = "3796cf51b8726652a4204733b8fbb047cf00fb91a9837e22",
    .p_ciphertext           = "7ebfda6fa5da1dbffd82dc29b875798fbcef8ba0084fbd24",
    .p_key                  = "197afb02ffbd8f699dacae87094d5243",
    .p_ad                   = "",
    .p_nonce                = "31f8fa25827d48",
    .p_mac                  = "63af747cc88a001fa94e060290f209c4"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 128 - Count 77
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_128_decrypt77) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_128_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 128 Decrypt message_len=24 ad_len=0 mac_len=16 nonce_len=7 invalid 2",
    .p_plaintext            = "3796cf51b8726652a4204733b8fbb047cf00fb91a9837e22",
    .p_ciphertext           = "cbf133643851f91ddc7a1e19a0c21990459f2b7728da58f5",
    .p_key                  = "197afb02ffbd8f699dacae87094d5243",
    .p_ad                   = "",
    .p_nonce                = "5340ed7752c9ff",
    .p_mac                  = "cf3b8e6c8aeb5eeb0a5efb3700be45a2"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 128 - Count 120
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_128_decrypt120) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 128 Decrypt message_len=0 ad_len=32 mac_len=4 nonce_len=7 valid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "90929a4b0ac65b350ad1591611fe4829",
    .p_ad                   = "3796cf51b8726652a4204733b8fbb047cf00fb91a9837e22ec22b1a268f88e2c",
    .p_nonce                = "5a8aa485c316e9",
    .p_mac                  = "782e4318"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 128 - Count 121
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_128_decrypt121) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_128_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 128 Decrypt message_len=0 ad_len=32 mac_len=4 nonce_len=7 invalid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "90929a4b0ac65b350ad1591611fe4829",
    .p_ad                   = "a2248a882ecbf850daf91933a389e78e81623d233dfd47bf8321361a38f138fe",
    .p_nonce                = "a265480ca88d5f",
    .p_mac                  = "a04f270a"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 128 - Count 122
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_128_decrypt122) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_128_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 128 Decrypt message_len=0 ad_len=32 mac_len=4 nonce_len=7 invalid 2",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "90929a4b0ac65b350ad1591611fe4829",
    .p_ad                   = "2bed1ec06c1ca149d9ffbaf048c474ea2de000eb7950f18d6c25acf6ab3f19b5",
    .p_nonce                = "87ec7423f1ebfc",
    .p_mac                  = "97dfd257"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 128 - Count 135
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_128_decrypt135) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 128 Decrypt message_len=0 ad_len=32 mac_len=16 nonce_len=7 valid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "6a798d7c5e1a72b43e20ad5c7b08567b",
    .p_ad                   = "3796cf51b8726652a4204733b8fbb047cf00fb91a9837e22ec22b1a268f88e2c",
    .p_nonce                = "5a8aa485c316e9",
    .p_mac                  = "41b476013f45e4a781f253a6f3b1e530"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 128 - Count 136
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_128_decrypt136) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_128_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 128 Decrypt message_len=0 ad_len=32 mac_len=16 nonce_len=7 invalid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "6a798d7c5e1a72b43e20ad5c7b08567b",
    .p_ad                   = "a2248a882ecbf850daf91933a389e78e81623d233dfd47bf8321361a38f138fe",
    .p_nonce                = "a265480ca88d5f",
    .p_mac                  = "f9f018fcd125822616083fffebc4c8e6"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 128 - Count 137
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_128_decrypt137) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_128_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 128 Decrypt message_len=0 ad_len=32 mac_len=16 nonce_len=7 invalid 2",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "6a798d7c5e1a72b43e20ad5c7b08567b",
    .p_ad                   = "2bed1ec06c1ca149d9ffbaf048c474ea2de000eb7950f18d6c25acf6ab3f19b5",
    .p_nonce                = "87ec7423f1ebfc",
    .p_mac                  = "534cc67c44c877c9c908071ee1082f4c"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 128 - Count 180
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_128_decrypt180) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 128 Decrypt message_len=24 ad_len=32 mac_len=4 nonce_len=7 valid 1",
    .p_plaintext            = "a265480ca88d5f536db0dc6abc40faf0d05be7a966977768",
    .p_ciphertext           = "6be31860ca271ef448de8f8d8b39346daf4b81d7e92d65b3",
    .p_key                  = "f9fdca4ac64fe7f014de0f43039c7571",
    .p_ad                   = "3796cf51b8726652a4204733b8fbb047cf00fb91a9837e22ec22b1a268f88e2c",
    .p_nonce                = "5a8aa485c316e9",
    .p_mac                  = "38f125fa"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 128 - Count 181
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_128_decrypt181) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_128_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 128 Decrypt message_len=24 ad_len=32 mac_len=4 nonce_len=7 invalid 1",
    .p_plaintext            = "a265480ca88d5f536db0dc6abc40faf0d05be7a966977768",
    .p_ciphertext           = "4cc57a9927a6bc401441870d3193bf89ebd163f5c01501c7",
    .p_key                  = "f9fdca4ac64fe7f014de0f43039c7571",
    .p_ad                   = "5b92394f21ddc3ad49d9b0881b829a5935cb3a4d23e292a62fb66b5e7ab7020e",
    .p_nonce                = "fdd2d6f503c915",
    .p_mac                  = "28a66b69"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 128 - Count 182
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_128_decrypt182) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_128_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 128 Decrypt message_len=24 ad_len=32 mac_len=4 nonce_len=7 invalid 2",
    .p_plaintext            = "a265480ca88d5f536db0dc6abc40faf0d05be7a966977768",
    .p_ciphertext           = "1f16c6d370fff40c011a243356076b67e905d4672ae2f38f",
    .p_key                  = "f9fdca4ac64fe7f014de0f43039c7571",
    .p_ad                   = "f6468542923be79b4b06dfe70920d57d1da73a9c16f9c9a12d810d7de0d12467",
    .p_nonce                = "27d73d58100054",
    .p_mac                  = "ee2de18c"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 128 - Count 195
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_128_decrypt195) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 128 Decrypt message_len=24 ad_len=32 mac_len=16 nonce_len=7 valid 1",
    .p_plaintext            = "a265480ca88d5f536db0dc6abc40faf0d05be7a966977768",
    .p_ciphertext           = "b351ab96b2e45515254558d5212673ee6c776d42dbca3b51",
    .p_key                  = "a7aa635ea51b0bb20a092bd5573e728c",
    .p_ad                   = "3796cf51b8726652a4204733b8fbb047cf00fb91a9837e22ec22b1a268f88e2c",
    .p_nonce                = "5a8aa485c316e9",
    .p_mac                  = "2cf3a20b7fd7c49e6e79bef475c2906f"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 128 - Count 196
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_128_decrypt196) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_128_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 128 Decrypt message_len=24 ad_len=32 mac_len=16 nonce_len=7 invalid 1",
    .p_plaintext            = "a265480ca88d5f536db0dc6abc40faf0d05be7a966977768",
    .p_ciphertext           = "df1a5285caa41b4bb47f6e5ceceba4e82721828d68427a30",
    .p_key                  = "a7aa635ea51b0bb20a092bd5573e728c",
    .p_ad                   = "5b92394f21ddc3ad49d9b0881b829a5935cb3a4d23e292a62fb66b5e7ab7020e",
    .p_nonce                = "fdd2d6f503c915",
    .p_mac                  = "81d18ca149d6766bfaccec88f194eb5b"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 128 - Count 197
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_128_decrypt197) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_128_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 128 Decrypt message_len=24 ad_len=32 mac_len=16 nonce_len=7 invalid 2",
    .p_plaintext            = "a265480ca88d5f536db0dc6abc40faf0d05be7a966977768",
    .p_ciphertext           = "04a29fc109dfc626e8297e0f586d0bfaf31260017d95f62d",
    .p_key                  = "a7aa635ea51b0bb20a092bd5573e728c",
    .p_ad                   = "f6468542923be79b4b06dfe70920d57d1da73a9c16f9c9a12d810d7de0d12467",
    .p_nonce                = "27d73d58100054",
    .p_mac                  = "5eb4f0875dda5ccd9b94026ba49fb34e"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 128 - Count 210
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_128_decrypt210) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 128 Decrypt message_len=24 ad_len=32 mac_len=4 nonce_len=13 valid 1",
    .p_plaintext            = "8739b4bea1a099fe547499cbc6d1b13d849b8084c9b6acc5",
    .p_ciphertext           = "934f893824e880f743d196b22d1f340a52608155087bd28a",
    .p_key                  = "a7aa635ea51b0bb20a092bd5573e728c",
    .p_ad                   = "a16a2e741f1cd9717285b6d882c1fc53655e9773761ad697a7ee6410184c7982",
    .p_nonce                = "5a8aa485c316e9403aff859fbb",
    .p_mac                  = "c25e5329"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 128 - Count 211
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_128_decrypt211) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_128_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 128 Decrypt message_len=24 ad_len=32 mac_len=4 nonce_len=13 invalid 1",
    .p_plaintext            = "8739b4bea1a099fe547499cbc6d1b13d849b8084c9b6acc5",
    .p_ciphertext           = "f43ba9d834ad85dfab3f1c0c27c3441fe4e411a38a261a65",
    .p_key                  = "a7aa635ea51b0bb20a092bd5573e728c",
    .p_ad                   = "ec6c44a7e94e51a3ca6dee229098391575ec7213c85267fbf7492fdbeee61b10",
    .p_nonce                = "0812757ad0cc4d17c4cfe7a642",
    .p_mac                  = "59b3b3ee"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 128 - Count 212
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_128_decrypt212) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_128_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 128 Decrypt message_len=24 ad_len=32 mac_len=4 nonce_len=13 invalid 2",
    .p_plaintext            = "8739b4bea1a099fe547499cbc6d1b13d849b8084c9b6acc5",
    .p_ciphertext           = "c686eac859a7bae3cce97d0b6527a0a7c8c2b24ece35f437",
    .p_key                  = "a7aa635ea51b0bb20a092bd5573e728c",
    .p_ad                   = "0923b927b8295c5dfaf67da55e5014293bc8c708fda50af06c1e8aef31cccc86",
    .p_nonce                = "eff510acc1b85f35029cf7dc00",
    .p_mac                  = "0bf6688e"
};

