OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0_59ac345/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_aead_ccm.c
#endif // NRF_MODULE_ENABLED(NRF_CRYPTO_AES_CCM_128)

#if NRF_MODULE_ENABLED(NRF_CRYPTO_AES_CCM_STAR_128)

// AES CCM STAR - Formal Specification of the CCM* Mode of Operation, September 16, 2004 - 2.5.
NRF_SECTION_ITEM_REGISTER(test_vector_aead_data, test_vector_aead_t test_vector_aes_ccm_star_128_spec) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_star_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM STAR 128 message_len=23 ad_len=8 mac_len=8 nonce_len=13",
    .p_plaintext            = "08090a0b0c0d0e0f101112131415161718191a1b1c1d1e",
    .p_ciphertext           = "1a55a36abb6c610d066b3375649cef10d4664ecad854a8",
    .p_key                  = "c0c1c2c3c4c5c6c7c8c9cacbcccdcecf",
    .p_ad                   = "0001020304050607",
    .p_nonce                = "a0a1a2a3a4a5a6a70302010006",
    .p_mac                  = "0a895cc1d8ff9469"
};

// AES CCM STAR - Formal Specification of the CCM* Mode of Operation, September 9, 2005 - 2.6. Not supported in cc310 lib.
NRF_SECTION_ITEM_REGISTER(test_vector_aead_data, test_vector_aead_t test_vector_aes_ccm_star_128_spec_2) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_star_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM STAR 128 message_len=0 ad_len=26 mac_len=8 nonce_len=13",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "c0c1c2c3c4c5c6c7c8c9cacbcccdcecf",
    .p_ad                   = "08d0842143010000000048deac020500000055cf000051525354",
    .p_nonce                = "acde4800000000010000000502",
    .p_mac                  = "223bc1ec841ab553"
};

// AES CCM STAR - Formal Specification of the CCM* Mode of Operation, September 9, 2005 - 2.7.
NRF_SECTION_ITEM_REGISTER(test_vector_aead_data, test_vector_aead_t test_vector_aes_ccm_star_128_spec_3) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_star_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM STAR 128 message_len=4 ad_len=26 mac_len=0 nonce_len=13",
    .p_plaintext            = "61626364",
    .p_ciphertext           = "d43e022b",
    .p_key                  = "c0c1c2c3c4c5c6c7c8c9cacbcccdcecf",
    .p_ad                   = "69dc842143020000000048deac010000000048deac0405000000",
    .p_nonce                = "acde4800000000010000000504",
    .p_mac                  = ""
};

// AES CCM STAR - Formal Specification of the CCM* Mode of Operation, September 9, 2005 - 2.8.
NRF_SECTION_ITEM_REGISTER(test_vector_aead_data, test_vector_aead_t test_vector_aes_ccm_star_128_spec_4) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_star_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM STAR 128 message_len=1 ad_len=29 mac_len=8 nonce_len=13",
    .p_plaintext            = "ce",
    .p_ciphertext           = "d8",
    .p_key                  = "c0c1c2c3c4c5c6c7c8c9cacbcccdcecf",
    .p_ad                   = "2bdc842143020000000048deacffff010000000048deac060500000001",
    .p_nonce                = "acde4800000000010000000506",
    .p_mac                  = "4fde529061f9c6f1"
};

// AES CCM STAR - Custom Test vector.
NRF_SECTION_ITEM_REGISTER(test_vector_aead_data, test_vector_aead_t test_vector_aes_ccm_star_128_level_0) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_star_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM STAR 128 Security level 0",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "d1fa7145ecd7a327ca3a8b58cd1147e6",
    .p_ad                   = "",
    .p_nonce                = "01f04f8873ea675d98a43a4e00",
    .p_mac                  = ""
};

// AES CCM STAR - Custom Test vector.
NRF_SECTION_ITEM_REGISTER(test_vector_aead_data, test_vector_aead_t test_vector_aes_ccm_star_128_level_1) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_star_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM STAR 128 Security level 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "d1fa7145ecd7a327ca3a8b58cd1147e6",
    .p_ad                   = "",
    .p_nonce                = "01f04f8873ea675d98a43a4e01",
    .p_mac                  = "fc91d4fb"
};

// AES CCM STAR - Custom Test vector.
NRF_SECTION_ITEM_REGISTER(test_vector_aead_data, test_vector_aead_t test_vector_aes_ccm_star_128_level_2) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_star_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM STAR 128 Security level 2",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "d1fa7145ecd7a327ca3a8b58cd1147e6",
    .p_ad                   = "",
    .p_nonce                = "01f04f8873ea675d98a43a4e02",
    .p_mac                  = "dc52d7f5b66dde7f"
};

// AES CCM STAR - Custom Test vector.
NRF_SECTION_ITEM_REGISTER(test_vector_aead_data, test_vector_aead_t test_vector_aes_ccm_star_128_level_3) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_star_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM STAR 128 Security level 3",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "d1fa7145ecd7a327ca3a8b58cd1147e6",
    .p_ad                   = "",
    .p_nonce                = "01f04f8873ea675d98a43a4e03",
    .p_mac                  = "38e9c4fc3b4129d893bba206c820bb67"
};

// AES CCM STAR - Custom Test vector.
NRF_SECTION_ITEM_REGISTER(test_vector_aead_data, test_vector_aead_t test_vector_aes_ccm_star_128_level_4) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_star_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM STAR 128 Security level 4",
    .p_plaintext            = "34cb14f841ef56495779d46b21978724",
    .p_ciphertext           = "d16c46686c549404206596899b935c4b",
    .p_key                  = "d1fa7145ecd7a327ca3a8b58cd1147e6",
    .p_ad                   = "",
    .p_nonce                = "01f04f8873ea675d98a43a4e04",
    .p_mac                  = ""
};

// AES CCM STAR - Custom Test vector.
NRF_SECTION_ITEM_REGISTER(test_vector_aead_data, test_vector_aead_t test_vector_aes_ccm_star_128_level_5) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_star_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM STAR 128 Security level 5",
    .p_plaintext            = "34cb14f841ef56495779d46b21978724",
    .p_ciphertext           = "44d1db2dc774a623ada69afd47b952af",
    .p_key                  = "d1fa7145ecd7a327ca3a8b58cd1147e6",
    .p_ad                   = "",
    .p_nonce                = "01f04f8873ea675d98a43a4e05",
    .p_mac                  = "031367fb"
};

// AES CCM STAR - Custom Test vector.
NRF_SECTION_ITEM_REGISTER(test_vector_aead_data, test_vector_aead_t test_vector_aes_ccm_star_128_level_6) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_star_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM STAR 128 Security level 6",
    .p_plaintext            = "34cb14f841ef56495779d46b21978724",
    .p_ciphertext           = "96b87289284ed8779e98a5bf55d16f00",
    .p_key                  = "d1fa7145ecd7a327ca3a8b58cd1147e6",
    .p_ad                   = "04ebed593e86388a",
    .p_nonce                = "01f04f8873ea675d98a43a4e06",
    .p_mac                  = "a3fd8b8dae862dc5"
};

// AES CCM STAR - Custom Test vector.
NRF_SECTION_ITEM_REGISTER(test_vector_aead_data, test_vector_aead_t test_vector_aes_ccm_star_128_level_7) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_star_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM STAR 128 Security level 7",
    .p_plaintext            = "34cb14f841ef56495779d46b21978724",
    .p_ciphertext           = "604e3fe798363abfb65c29a7dd3ba533",
    .p_key                  = "d1fa7145ecd7a327ca3a8b58cd1147e6",
    .p_ad                   = "04ebed593e86388a",
    .p_nonce                = "01f04f8873ea675d98a43a4e07",
    .p_mac                  = "4eb450488d495c1092f65217aa6b3de8"
};

// AES CCM STAR - Custom Test vector.
NRF_SECTION_ITEM_REGISTER(test_vector_aead_data, test_vector_aead_t test_vector_aes_ccm_star_128_0) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_star_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM STAR 128 message_len=0 ad_len=8 mac_len=0 nonce_len=13",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "d1fa7145ecd7a327ca3a8b58cd1147e6",
    .p_ad                   = "04ebed593e86388a",
    .p_nonce                = "01f04f8873ea675d98a43a4e00",
    .p_mac                  = ""
};

// AES CCM STAR - Custom Test vector.
NRF_SECTION_ITEM_REGISTER(test_vector_aead_data, test_vector_aead_t test_vector_aes_ccm_star_128_1) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_star_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM STAR 128 message_len=16 ad_len=8 mac_len=0 nonce_len=13",
    .p_plaintext            = "34cb14f841ef56495779d46b21978724",
    .p_ciphertext           = "d16c46686c549404206596899b935c4b",
    .p_key                  = "d1fa7145ecd7a327ca3a8b58cd1147e6",
    .p_ad                   = "04ebed593e86388a",
    .p_nonce                = "01f04f8873ea675d98a43a4e04",
    .p_mac                  = ""
};

// AES CCM STAR - Custom Test vector.
NRF_SECTION_ITEM_REGISTER(test_vector_aead_data, test_vector_aead_t test_vector_aes_ccm_star_128_2) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_star_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM STAR 128 message_len=16 ad_len=8 mac_len=4 nonce_len=13",
    .p_plaintext            = "34cb14f841ef56495779d46b21978724",
    .p_ciphertext           = "44d1db2dc774a623ada69afd47b952af",
    .p_key                  = "d1fa7145ecd7a327ca3a8b58cd1147e6",
    .p_ad                   = "04ebed593e86388a",
    .p_nonce                = "01f04f8873ea675d98a43a4e05",
    .p_mac                  = "d01b3d22"
};

// AES CCM STAR - Custom Test vector.
NRF_SECTION_ITEM_REGISTER(test_vector_aead_data, test_vector_aead_t test_vector_aes_ccm_star_128_3) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_star_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM STAR 128 message_len=250 ad_len=8 mac_len=8 nonce_len=13",
    .p_plaintext            = "27d37753eea01ca96d03840176e29a3a5c7b5ce8978f293478915ccaaee70eb1159de4bbb4af9ff9e10878bb1d0d40ea63c38693d222c34923f57e640a31e5e099cc5d043407b2c5ad059603a76b9b1498e7b972c924f1211890e887423118c6470c922c6b6179718fa60903ef9a9c6671f413525d79015b936f465704abe06a11dc2b5b2e1bc9b79d4916da565f0efd05cb151a6263c2c2ba4a87e07a2bbb6a4992bc6678fa7ffd8db19d681c61737325cde751932f94cacc977edf7d5bb91a4a486b6959c792deb3adaaedc6a9efba651991cc625760b2d08b555c59967081fd2bb0701ca50a74f0dbca3f1cbc44c682e5629b2876b7587fd0",
    .p_ciphertext           = "85a0112287019297a4e2f5d502a4721e3d3458fa5744ce738e9e49ba4a85f88129146bd808f6322fbcbae5763813081d7ea3bb708571581329d99a5326b0b98725374c7df07d18f378f86a4fb5864b911e1e7a66780741ac6133fcf921505fe94509d277ddb62839fa55dcb3dd76eb50379ba20576c815678a316146d963abd9ca2586591a5cd1b0ddc75ffd1f64cfa3d7ece393a8036668390e5a87d770081f41b2df3c288b97ec756f20170aa7d83fb37b4a0570ec1d8abb1f180017473fd4edcf802ec5ade4eb0bc617675f72a9a531bd5a48e2f4e055975e25de130bc160c93f333bc7d149e932459e015e44bd95a53531e67fac5ec94689",
    .p_key                  = "d1fa7145ecd7a327ca3a8b58cd1147e6",
    .p_ad                   = "04ebed593e86388a",
    .p_nonce                = "01f04f8873ea675d98a43a4e06",
    .p_mac                  = "14a407a361e30073"
};

// AES CCM STAR - Custom Test vector.
NRF_SECTION_ITEM_REGISTER(test_vector_aead_data, test_vector_aead_t test_vector_aes_ccm_star_128_4) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_star_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM STAR 128 message_len=16 ad_len=250 mac_len=8 nonce_len=13",
    .p_plaintext            = "34cb14f841ef56495779d46b21978724",
    .p_ciphertext           = "96b87289284ed8779e98a5bf55d16f00",
    .p_key                  = "d1fa7145ecd7a327ca3a8b58cd1147e6",
    .p_ad                   = "690ad6de2661681e8f02b16710372eb9992ea97ab1976a7c2b2b15b08500b307e5d6c7501fff91b71e07d70104c35fbafe9d62dca19005703ff896ea429112aedeb6c9a5c5bc9f7df1d1fae08049ec1f72f050e6758c72c7584ceb89dc86e79112b42d0052b96e5ba155e9b21240c87bdd309ab8f6d88de816c9ddfde6b95af7ee617f379f5235a86a99322a33e5fb9470eb9d19c42e73386098c50b10a7d5d423858f92334ff55143158b00a75ea59ffea0dc107c3d7bfc1f564b2140f8efe2faeb587978bf305a1c6e90077d846426b4543efd4aa916fda72326ef04eebedbdf276dcff15dc1b8eedb3051c57fe9f405366a51c81ed4529cd2",
    .p_nonce                = "01f04f8873ea675d98a43a4e06",
    .p_mac                  = "bc3df5a9240a81d4"
};

// AES CCM STAR - Custom test vector - Invalid behavior test for AES buffer authenticated decryption.
NRF_SECTION_ITEM_REGISTER(test_vector_aead_data, test_vector_aead_t test_vector_aes_ccm_star_128_inv_c0) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_star_128_info,
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_NONCE_SIZE,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .p_test_vector_name     = "CCM STAR 128 Invalid nonce_len=12",
    .p_plaintext            = "08090a0b0c0d0e0f101112131415161718191a1b1c1d1e",
    .p_ciphertext           = "1a55a36abb6c610d066b3375649cef10d4664ecad854a8",
    .p_key                  = "c0c1c2c3c4c5c6c7c8c9cacbcccdcecf",
    .p_ad                   = "0001020304050607",
    .p_nonce                = "a0a1a2a3a4a5a6a703020100",
    .p_mac                  = "0a895cc1d8ff9469"
};

// AES CCM STAR - Custom test vector - Invalid behavior test for AES buffer authenticated decryption.
NRF_SECTION_ITEM_REGISTER(test_vector_aead_data, test_vector_aead_t test_vector_aes_ccm_star_128_inv_c1) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_star_128_info,
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_NONCE_SIZE,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .p_test_vector_name     = "CCM STAR 128 Invalid nonce_len=14",
    .p_plaintext            = "08090a0b0c0d0e0f101112131415161718191a1b1c1d1e",
    .p_ciphertext           = "1a55a36abb6c610d066b3375649cef10d4664ecad854a8",
    .p_key                  = "c0c1c2c3c4c5c6c7c8c9cacbcccdcecf",
    .p_ad                   = "0001020304050607",
    .p_nonce                = "a0a1a2a3a4a5a6a7030201000606",
    .p_mac                  = "0a895cc1d8ff9469"
};

// AES CCM STAR - Custom test vector - Invalid behavior test for AES buffer authenticated decryption.
NRF_SECTION_ITEM_REGISTER(test_vector_aead_data, test_vector_aead_t test_vector_aes_ccm_star_128_inv_c2) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_star_128_info,
    .expected_err_code      = NRF_ERROR_CRYPTO_INVALID_PARAM,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .p_test_vector_name     = "CCM STAR 128 Invalid CCM STAR Security level field",
    .p_plaintext            = "08090a0b0c0d0e0f101112131415161718191a1b1c1d1e",
    .p_ciphertext           = "1a55a36abb6c610d066b3375649cef10d4664ecad854a8",
    .p_key                  = "c0c1c2c3c4c5c6c7c8c9cacbcccdcecf",
    .p_ad                   = "0001020304050607",
    .p_nonce                = "a0a1a2a3a4a5a6a70302010007",
    .p_mac                  = "0a895cc1d8ff9469"
};

// AES CCM STAR - Custom Test vector.
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_ccm_star_128_inv_c4) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_star_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM STAR 128 Encrypt with invalid AES key",
    .p_plaintext            = "34cb14f841ef56495779d46b21978724",
    .p_ciphertext           = "96b87289284ed8779e98a5bf55d16f00",
    .p_key                  = "e1fa7145ecd7a327ca3a8b58cd1147e6",
    .p_ad                   = "04ebed593e86388a",
    .p_nonce                = "01f04f8873ea675d98a43a4e06",
    .p_mac                  = "a3fd8b8dae862dc5"
};

// AES CCM STAR - Custom Test vector.
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_ccm_star_128_inv_c5) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_star_128_info,
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM STAR 128 Decrypt with invalid AES key",
    .p_plaintext            = "34cb14f841ef56495779d46b21978724",
    .p_ciphertext           = "96b87289284ed8779e98a5bf55d16f00",
    .p_key                  = "e1fa7145ecd7a327ca3a8b58cd1147e6",
    .p_ad                   = "04ebed593e86388a",
    .p_nonce                = "01f04f8873ea675d98a43a4e06",
    .p_mac                  = "a3fd8b8dae862dc5"
};

// AES CCM STAR - Custom Test vector.
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_ccm_star_128_inv_c6) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_star_128_info,
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM STAR 128 Decrypt Invalid MAC",
    .p_plaintext            = "34cb14f841ef56495779d46b21978724",
    .p_ciphertext           = "96b87289284ed8779e98a5bf55d16f00",
    .p_key                  = "d1fa7145ecd7a327ca3a8b58cd1147e6",
    .p_ad                   = "04ebed593e86388a",
    .p_nonce                = "01f04f8873ea675d98a43a4e06",
    .p_mac                  = "b3fd8b8dae862dc5"
};

// AES CCM STAR - Custom Test vector.
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_ccm_star_128_inv_c7) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_star_128_info,
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM STAR 128 Decrypt Invalid ciphertext",
    .p_plaintext            = "34cb14f841ef56495779d46b21978724",
    .p_ciphertext           = "a6b87289284ed8779e98a5bf55d16f00",
    .p_key                  = "d1fa7145ecd7a327ca3a8b58cd1147e6",
    .p_ad                   = "04ebed593e86388a",
    .p_nonce                = "01f04f8873ea675d98a43a4e06",
    .p_mac                  = "a3fd8b8dae862dc5"
};

