OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0_59ac345/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_aead_ccm.c
// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 192 - Count 31
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_encrypt31) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 192 Encrypt message_len=0 ad_len=0 mac_len=4 nonce_len=13 invalid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "4bb3c4a4f893ad8c9bdc833c325d62b3d3ad1bccf9282a65",
    .p_ad                   = "",
    .p_nonce                = "a16a2e741f1cd9717285b6d882",
    .p_mac                  = "db7ffc82"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 192 - Count 32
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_encrypt32) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 192 Encrypt message_len=0 ad_len=0 mac_len=4 nonce_len=13 invalid 2",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "4bb3c4a4f893ad8c9bdc833c325d62b3d3ad1bccf9282a65",
    .p_ad                   = "",
    .p_nonce                = "368f3b8180fd4b851b7b272cb1",
    .p_mac                  = "7a677329"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 192 - Count 45
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_encrypt45) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 192 Encrypt message_len=0 ad_len=0 mac_len=16 nonce_len=13 valid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "19ebfde2d5468ba0a3031bde629b11fd4094afcb205393fa",
    .p_ad                   = "",
    .p_nonce                = "5a8aa485c316e9403aff859fbb",
    .p_mac                  = "0c66a8e547ed4f8c2c9a9a1eb5d455b9"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 192 - Count 46
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_encrypt46) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 192 Encrypt message_len=0 ad_len=0 mac_len=16 nonce_len=13 invalid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "19ebfde2d5468ba0a3031bde629b11fd4094afcb205393fa",
    .p_ad                   = "",
    .p_nonce                = "a16a2e741f1cd9717285b6d882",
    .p_mac                  = "38757b3a61a4dc97ca3ab88bf1240695"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 192 - Count 47
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_encrypt47) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 192 Encrypt message_len=0 ad_len=0 mac_len=16 nonce_len=13 invalid 2",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "19ebfde2d5468ba0a3031bde629b11fd4094afcb205393fa",
    .p_ad                   = "",
    .p_nonce                = "368f3b8180fd4b851b7b272cb1",
    .p_mac                  = "11875da4445d92391d0fab5f3625497b"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 192 - Count 60
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_encrypt60) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 192 Encrypt message_len=24 ad_len=0 mac_len=4 nonce_len=7 valid 1",
    .p_plaintext            = "3796cf51b8726652a4204733b8fbb047cf00fb91a9837e22",
    .p_ciphertext           = "411986d04d6463100bff03f7d0bde7ea2c3488784378138c",
    .p_key                  = "19ebfde2d5468ba0a3031bde629b11fd4094afcb205393fa",
    .p_ad                   = "",
    .p_nonce                = "5a8aa485c316e9",
    .p_mac                  = "ddc93a54"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 192 - Count 61
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_encrypt61) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 192 Encrypt message_len=24 ad_len=0 mac_len=4 nonce_len=7 invalid 1",
    .p_plaintext            = "3796cf51b8726652a4204733b8fbb047cf00fb91a9837e22",
    .p_ciphertext           = "32b649ab56162e55d4148a1292d6a225a988eb1308298273",
    .p_key                  = "19ebfde2d5468ba0a3031bde629b11fd4094afcb205393fa",
    .p_ad                   = "",
    .p_nonce                = "31f8fa25827d48",
    .p_mac                  = "b6889036"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 192 - Count 62
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_encrypt62) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 192 Encrypt message_len=24 ad_len=0 mac_len=4 nonce_len=7 invalid 2",
    .p_plaintext            = "3796cf51b8726652a4204733b8fbb047cf00fb91a9837e22",
    .p_ciphertext           = "a963c3568ab413b174cd95cc1e3ca61ee181292bebdb2817",
    .p_key                  = "19ebfde2d5468ba0a3031bde629b11fd4094afcb205393fa",
    .p_ad                   = "",
    .p_nonce                = "5340ed7752c9ff",
    .p_mac                  = "9b4de35f"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 192 - Count 75
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_encrypt75) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 192 Encrypt message_len=24 ad_len=0 mac_len=16 nonce_len=7 valid 1",
    .p_plaintext            = "3796cf51b8726652a4204733b8fbb047cf00fb91a9837e22",
    .p_ciphertext           = "cba4b4aeb85f0492fd8d905c4a6d8233139833373ef188a8",
    .p_key                  = "197afb02ffbd8f699dacae87094d524324576b99844f75e1",
    .p_ad                   = "",
    .p_nonce                = "5a8aa485c316e9",
    .p_mac                  = "c5a5ebecf7ac8607fe412189e83d9d20"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 192 - Count 76
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_encrypt76) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 192 Encrypt message_len=24 ad_len=0 mac_len=16 nonce_len=7 invalid 1",
    .p_plaintext            = "3796cf51b8726652a4204733b8fbb047cf00fb91a9837e22",
    .p_ciphertext           = "ca62713728b5c9d652504b0ae8fd4fee5d297ee6a8d19cb6",
    .p_key                  = "197afb02ffbd8f699dacae87094d524324576b99844f75e1",
    .p_ad                   = "",
    .p_nonce                = "31f8fa25827d48",
    .p_mac                  = "e699f15f14d34dcaf9ba8ed4b877c97d"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 192 - Count 77
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_encrypt77) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 192 Encrypt message_len=24 ad_len=0 mac_len=16 nonce_len=7 invalid 2",
    .p_plaintext            = "3796cf51b8726652a4204733b8fbb047cf00fb91a9837e22",
    .p_ciphertext           = "93012c0a5f6f1025b8c4a5d897d3eea0b1c77be8000c9e59",
    .p_key                  = "197afb02ffbd8f699dacae87094d524324576b99844f75e1",
    .p_ad                   = "",
    .p_nonce                = "5340ed7752c9ff",
    .p_mac                  = "f3b8899459788c58794f177cfd838f35"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 192 - Count 120
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_encrypt120) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 192 Encrypt message_len=0 ad_len=32 mac_len=4 nonce_len=7 valid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "90929a4b0ac65b350ad1591611fe48297e03956f6083e451",
    .p_ad                   = "3796cf51b8726652a4204733b8fbb047cf00fb91a9837e22ec22b1a268f88e2c",
    .p_nonce                = "5a8aa485c316e9",
    .p_mac                  = "1d089a5f"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 192 - Count 121
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_encrypt121) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 192 Encrypt message_len=0 ad_len=32 mac_len=4 nonce_len=7 invalid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "90929a4b0ac65b350ad1591611fe48297e03956f6083e451",
    .p_ad                   = "a2248a882ecbf850daf91933a389e78e81623d233dfd47bf8321361a38f138fe",
    .p_nonce                = "a265480ca88d5f",
    .p_mac                  = "2f46022a"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 192 - Count 122
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_encrypt122) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 192 Encrypt message_len=0 ad_len=32 mac_len=4 nonce_len=7 invalid 2",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "90929a4b0ac65b350ad1591611fe48297e03956f6083e451",
    .p_ad                   = "2bed1ec06c1ca149d9ffbaf048c474ea2de000eb7950f18d6c25acf6ab3f19b5",
    .p_nonce                = "87ec7423f1ebfc",
    .p_mac                  = "67dc4693"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 192 - Count 135
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_encrypt135) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 192 Encrypt message_len=0 ad_len=32 mac_len=16 nonce_len=7 valid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "6a798d7c5e1a72b43e20ad5c7b08567b12ab744b61c070e2",
    .p_ad                   = "3796cf51b8726652a4204733b8fbb047cf00fb91a9837e22ec22b1a268f88e2c",
    .p_nonce                = "5a8aa485c316e9",
    .p_mac                  = "5280a2137fee3deefcfe9b63a1199fb3"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 192 - Count 136
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_encrypt136) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 192 Encrypt message_len=0 ad_len=32 mac_len=16 nonce_len=7 invalid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "6a798d7c5e1a72b43e20ad5c7b08567b12ab744b61c070e2",
    .p_ad                   = "a2248a882ecbf850daf91933a389e78e81623d233dfd47bf8321361a38f138fe",
    .p_nonce                = "a265480ca88d5f",
    .p_mac                  = "d40a7318c5f2d82f838c0beeefe0d598"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 192 - Count 137
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_encrypt137) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 192 Encrypt message_len=0 ad_len=32 mac_len=16 nonce_len=7 invalid 2",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "6a798d7c5e1a72b43e20ad5c7b08567b12ab744b61c070e2",
    .p_ad                   = "2bed1ec06c1ca149d9ffbaf048c474ea2de000eb7950f18d6c25acf6ab3f19b5",
    .p_nonce                = "87ec7423f1ebfc",
    .p_mac                  = "7551978bc9592bf9e294b4984c5862bb"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 192 - Count 180
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_encrypt180) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 192 Encrypt message_len=24 ad_len=32 mac_len=4 nonce_len=7 valid 1",
    .p_plaintext            = "a265480ca88d5f536db0dc6abc40faf0d05be7a966977768",
    .p_ciphertext           = "9f6ca4af9b159148c889a6584d1183ea26e2614874b05045",
    .p_key                  = "f9fdca4ac64fe7f014de0f43039c757194d544ce5d15eed4",
    .p_ad                   = "3796cf51b8726652a4204733b8fbb047cf00fb91a9837e22ec22b1a268f88e2c",
    .p_nonce                = "5a8aa485c316e9",
    .p_mac                  = "75dea8d1"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 192 - Count 181
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_encrypt181) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 192 Encrypt message_len=24 ad_len=32 mac_len=4 nonce_len=7 invalid 1",
    .p_plaintext            = "a265480ca88d5f536db0dc6abc40faf0d05be7a966977768",
    .p_ciphertext           = "84d8212e9cfc2121252baa3b065b1edcf50497b9594db1eb",
    .p_key                  = "f9fdca4ac64fe7f014de0f43039c757194d544ce5d15eed4",
    .p_ad                   = "5b92394f21ddc3ad49d9b0881b829a5935cb3a4d23e292a62fb66b5e7ab7020e",
    .p_nonce                = "fdd2d6f503c915",
    .p_mac                  = "d7965825"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 192 - Count 182
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_encrypt182) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 192 Encrypt message_len=24 ad_len=32 mac_len=4 nonce_len=7 invalid 2",
    .p_plaintext            = "a265480ca88d5f536db0dc6abc40faf0d05be7a966977768",
    .p_ciphertext           = "5f60a8f867a33b2077ecc69863b295c3c6aeae7d7cade7f8",
    .p_key                  = "f9fdca4ac64fe7f014de0f43039c757194d544ce5d15eed4",
    .p_ad                   = "f6468542923be79b4b06dfe70920d57d1da73a9c16f9c9a12d810d7de0d12467",
    .p_nonce                = "27d73d58100054",
    .p_mac                  = "f7f796fe"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 192 - Count 195
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_encrypt195) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 192 Encrypt message_len=24 ad_len=32 mac_len=16 nonce_len=7 valid 1",
    .p_plaintext            = "a265480ca88d5f536db0dc6abc40faf0d05be7a966977768",
    .p_ciphertext           = "6aab64c4787599d8f213446beadb16e08dba60e97f56dbd1",
    .p_key                  = "a7aa635ea51b0bb20a092bd5573e728ccd4b3e8cdd2ab33d",
    .p_ad                   = "3796cf51b8726652a4204733b8fbb047cf00fb91a9837e22ec22b1a268f88e2c",
    .p_nonce                = "5a8aa485c316e9",
    .p_mac                  = "4d1d980d6fe0fb44b421992662b97975"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 192 - Count 196
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_encrypt196) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 192 Encrypt message_len=24 ad_len=32 mac_len=16 nonce_len=7 invalid 1",
    .p_plaintext            = "a265480ca88d5f536db0dc6abc40faf0d05be7a966977768",
    .p_ciphertext           = "4980b2ee49b1aaf393175f5ab9bae95ec7904557dfa20660",
    .p_key                  = "a7aa635ea51b0bb20a092bd5573e728ccd4b3e8cdd2ab33d",
    .p_ad                   = "5b92394f21ddc3ad49d9b0881b829a5935cb3a4d23e292a62fb66b5e7ab7020e",
    .p_nonce                = "fdd2d6f503c915",
    .p_mac                  = "3c51d36c826f01384100886198a7f6a3"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 192 - Count 197
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_encrypt197) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 192 Encrypt message_len=24 ad_len=32 mac_len=16 nonce_len=7 invalid 2",
    .p_plaintext            = "a265480ca88d5f536db0dc6abc40faf0d05be7a966977768",
    .p_ciphertext           = "86a02bdd6ae733eee26f8eab898b336105978b5bbd6df781",
    .p_key                  = "a7aa635ea51b0bb20a092bd5573e728ccd4b3e8cdd2ab33d",
    .p_ad                   = "f6468542923be79b4b06dfe70920d57d1da73a9c16f9c9a12d810d7de0d12467",
    .p_nonce                = "27d73d58100054",
    .p_mac                  = "758a111aae4f735b7dd4d9802f2a8406"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 192 - Count 210
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_encrypt210) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 192 Encrypt message_len=24 ad_len=32 mac_len=4 nonce_len=13 valid 1",
    .p_plaintext            = "8739b4bea1a099fe547499cbc6d1b13d849b8084c9b6acc5",
    .p_ciphertext           = "16e543d0e20615ff0df15acd9927ddfe40668a54bb854ccc",
    .p_key                  = "a7aa635ea51b0bb20a092bd5573e728ccd4b3e8cdd2ab33d",
    .p_ad                   = "a16a2e741f1cd9717285b6d882c1fc53655e9773761ad697a7ee6410184c7982",
    .p_nonce                = "5a8aa485c316e9403aff859fbb",
    .p_mac                  = "c25e9fce"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 192 - Count 211
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_encrypt211) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 192 Encrypt message_len=24 ad_len=32 mac_len=4 nonce_len=13 invalid 1",
    .p_plaintext            = "8739b4bea1a099fe547499cbc6d1b13d849b8084c9b6acc5",
    .p_ciphertext           = "df35b109caf690656ae278bbd8f8bba687a2ce11b105dae9",
    .p_key                  = "a7aa635ea51b0bb20a092bd5573e728ccd4b3e8cdd2ab33d",
    .p_ad                   = "ec6c44a7e94e51a3ca6dee229098391575ec7213c85267fbf7492fdbeee61b10",
    .p_nonce                = "0812757ad0cc4d17c4cfe7a642",
    .p_mac                  = "8ecedb3e"
};

