OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0_59ac345/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_aead_ccm.c
// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 192 - Count 212
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_encrypt212) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 192 Encrypt message_len=24 ad_len=32 mac_len=4 nonce_len=13 invalid 2",
    .p_plaintext            = "8739b4bea1a099fe547499cbc6d1b13d849b8084c9b6acc5",
    .p_ciphertext           = "7075da2291e2cb527eb926ed08d8020c5f8f0f2d4a6a4745",
    .p_key                  = "a7aa635ea51b0bb20a092bd5573e728ccd4b3e8cdd2ab33d",
    .p_ad                   = "0923b927b8295c5dfaf67da55e5014293bc8c708fda50af06c1e8aef31cccc86",
    .p_nonce                = "eff510acc1b85f35029cf7dc00",
    .p_mac                  = "728da544"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 192 - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_decrypt0) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 192 Decrypt message_len=0 ad_len=0 mac_len=4 nonce_len=7 valid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "c98ad7f38b2c7e970c9b965ec87a08208384718f78206c6c",
    .p_ad                   = "",
    .p_nonce                = "5a8aa485c316e9",
    .p_mac                  = "9d4b7f3b"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 192 - Count 1
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_decrypt1) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 192 Decrypt message_len=0 ad_len=0 mac_len=4 nonce_len=7 invalid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "c98ad7f38b2c7e970c9b965ec87a08208384718f78206c6c",
    .p_ad                   = "",
    .p_nonce                = "3796cf51b87266",
    .p_mac                  = "80745de9"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 192 - Count 2
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_decrypt2) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 192 Decrypt message_len=0 ad_len=0 mac_len=4 nonce_len=7 invalid 2",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "c98ad7f38b2c7e970c9b965ec87a08208384718f78206c6c",
    .p_ad                   = "",
    .p_nonce                = "89ca5a64050f9f",
    .p_mac                  = "2f6fa823"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 192 - Count 15
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_decrypt15) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 192 Decrypt message_len=0 ad_len=0 mac_len=16 nonce_len=7 valid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "4bb3c4a4f893ad8c9bdc833c325d62b3d3ad1bccf9282a65",
    .p_ad                   = "",
    .p_nonce                = "5a8aa485c316e9",
    .p_mac                  = "17223038fa99d53681ca1beabe78d1b4"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 192 - Count 16
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_decrypt16) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 192 Decrypt message_len=0 ad_len=0 mac_len=16 nonce_len=7 invalid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "4bb3c4a4f893ad8c9bdc833c325d62b3d3ad1bccf9282a65",
    .p_ad                   = "",
    .p_nonce                = "3796cf51b87266",
    .p_mac                  = "d0e1eeef4d2a264536bb1c2c1bde7c35"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 192 - Count 17
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_decrypt17) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 192 Decrypt message_len=0 ad_len=0 mac_len=16 nonce_len=7 invalid 2",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "4bb3c4a4f893ad8c9bdc833c325d62b3d3ad1bccf9282a65",
    .p_ad                   = "",
    .p_nonce                = "89ca5a64050f9f",
    .p_mac                  = "81d587f8673fd514c23172af7fb7523d"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 192 - Count 30
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_decrypt30) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 192 Decrypt message_len=0 ad_len=0 mac_len=4 nonce_len=13 valid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "4bb3c4a4f893ad8c9bdc833c325d62b3d3ad1bccf9282a65",
    .p_ad                   = "",
    .p_nonce                = "5a8aa485c316e9403aff859fbb",
    .p_mac                  = "fe69ed84"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 192 - Count 31
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_decrypt31) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 192 Decrypt message_len=0 ad_len=0 mac_len=4 nonce_len=13 invalid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "4bb3c4a4f893ad8c9bdc833c325d62b3d3ad1bccf9282a65",
    .p_ad                   = "",
    .p_nonce                = "a16a2e741f1cd9717285b6d882",
    .p_mac                  = "db7ffc82"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 192 - Count 32
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_decrypt32) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 192 Decrypt message_len=0 ad_len=0 mac_len=4 nonce_len=13 invalid 2",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "4bb3c4a4f893ad8c9bdc833c325d62b3d3ad1bccf9282a65",
    .p_ad                   = "",
    .p_nonce                = "368f3b8180fd4b851b7b272cb1",
    .p_mac                  = "7a677329"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 192 - Count 45
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_decrypt45) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 192 Decrypt message_len=0 ad_len=0 mac_len=16 nonce_len=13 valid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "19ebfde2d5468ba0a3031bde629b11fd4094afcb205393fa",
    .p_ad                   = "",
    .p_nonce                = "5a8aa485c316e9403aff859fbb",
    .p_mac                  = "0c66a8e547ed4f8c2c9a9a1eb5d455b9"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 192 - Count 46
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_decrypt46) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 192 Decrypt message_len=0 ad_len=0 mac_len=16 nonce_len=13 invalid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "19ebfde2d5468ba0a3031bde629b11fd4094afcb205393fa",
    .p_ad                   = "",
    .p_nonce                = "a16a2e741f1cd9717285b6d882",
    .p_mac                  = "38757b3a61a4dc97ca3ab88bf1240695"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 192 - Count 47
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_decrypt47) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 192 Decrypt message_len=0 ad_len=0 mac_len=16 nonce_len=13 invalid 2",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "19ebfde2d5468ba0a3031bde629b11fd4094afcb205393fa",
    .p_ad                   = "",
    .p_nonce                = "368f3b8180fd4b851b7b272cb1",
    .p_mac                  = "11875da4445d92391d0fab5f3625497b"
};

