OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0_59ac345/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_aead_ccm.c
// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 192 - Count 181
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_decrypt181) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 192 Decrypt message_len=24 ad_len=32 mac_len=4 nonce_len=7 invalid 1",
    .p_plaintext            = "a265480ca88d5f536db0dc6abc40faf0d05be7a966977768",
    .p_ciphertext           = "84d8212e9cfc2121252baa3b065b1edcf50497b9594db1eb",
    .p_key                  = "f9fdca4ac64fe7f014de0f43039c757194d544ce5d15eed4",
    .p_ad                   = "5b92394f21ddc3ad49d9b0881b829a5935cb3a4d23e292a62fb66b5e7ab7020e",
    .p_nonce                = "fdd2d6f503c915",
    .p_mac                  = "d7965825"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 192 - Count 182
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_decrypt182) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 192 Decrypt message_len=24 ad_len=32 mac_len=4 nonce_len=7 invalid 2",
    .p_plaintext            = "a265480ca88d5f536db0dc6abc40faf0d05be7a966977768",
    .p_ciphertext           = "5f60a8f867a33b2077ecc69863b295c3c6aeae7d7cade7f8",
    .p_key                  = "f9fdca4ac64fe7f014de0f43039c757194d544ce5d15eed4",
    .p_ad                   = "f6468542923be79b4b06dfe70920d57d1da73a9c16f9c9a12d810d7de0d12467",
    .p_nonce                = "27d73d58100054",
    .p_mac                  = "f7f796fe"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 192 - Count 195
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_decrypt195) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 192 Decrypt message_len=24 ad_len=32 mac_len=16 nonce_len=7 valid 1",
    .p_plaintext            = "a265480ca88d5f536db0dc6abc40faf0d05be7a966977768",
    .p_ciphertext           = "6aab64c4787599d8f213446beadb16e08dba60e97f56dbd1",
    .p_key                  = "a7aa635ea51b0bb20a092bd5573e728ccd4b3e8cdd2ab33d",
    .p_ad                   = "3796cf51b8726652a4204733b8fbb047cf00fb91a9837e22ec22b1a268f88e2c",
    .p_nonce                = "5a8aa485c316e9",
    .p_mac                  = "4d1d980d6fe0fb44b421992662b97975"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 192 - Count 196
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_decrypt196) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 192 Decrypt message_len=24 ad_len=32 mac_len=16 nonce_len=7 invalid 1",
    .p_plaintext            = "a265480ca88d5f536db0dc6abc40faf0d05be7a966977768",
    .p_ciphertext           = "4980b2ee49b1aaf393175f5ab9bae95ec7904557dfa20660",
    .p_key                  = "a7aa635ea51b0bb20a092bd5573e728ccd4b3e8cdd2ab33d",
    .p_ad                   = "5b92394f21ddc3ad49d9b0881b829a5935cb3a4d23e292a62fb66b5e7ab7020e",
    .p_nonce                = "fdd2d6f503c915",
    .p_mac                  = "3c51d36c826f01384100886198a7f6a3"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 192 - Count 197
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_decrypt197) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 192 Decrypt message_len=24 ad_len=32 mac_len=16 nonce_len=7 invalid 2",
    .p_plaintext            = "a265480ca88d5f536db0dc6abc40faf0d05be7a966977768",
    .p_ciphertext           = "86a02bdd6ae733eee26f8eab898b336105978b5bbd6df781",
    .p_key                  = "a7aa635ea51b0bb20a092bd5573e728ccd4b3e8cdd2ab33d",
    .p_ad                   = "f6468542923be79b4b06dfe70920d57d1da73a9c16f9c9a12d810d7de0d12467",
    .p_nonce                = "27d73d58100054",
    .p_mac                  = "758a111aae4f735b7dd4d9802f2a8406"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 192 - Count 210
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_192_decrypt210) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 192 Decrypt message_len=24 ad_len=32 mac_len=4 nonce_len=13 valid 1",
    .p_plaintext            = "8739b4bea1a099fe547499cbc6d1b13d849b8084c9b6acc5",
    .p_ciphertext           = "16e543d0e20615ff0df15acd9927ddfe40668a54bb854ccc",
    .p_key                  = "a7aa635ea51b0bb20a092bd5573e728ccd4b3e8cdd2ab33d",
    .p_ad                   = "a16a2e741f1cd9717285b6d882c1fc53655e9773761ad697a7ee6410184c7982",
    .p_nonce                = "5a8aa485c316e9403aff859fbb",
    .p_mac                  = "c25e9fce"
};

