OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0_59ac345/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_aead_ccm.c
// AES CCM - Custom test vector 5 - Invalid behavior test for AES key.
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_ccm_256_inv_c22) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 256 Decrypt with invalid AES key",
    .p_plaintext            = "08090a0b0c0d0e0f101112131415161718191a1b1c1d1e",
    .p_ciphertext           = "b7877d560c6f604032ff9a67b99a8ca3697a76ee40bc73",
    .p_key                  = "5a44110f37e0f8761aa1adc2eeae1c741568036b7eb3b3b8a7ae8ea41a353f5b",
    .p_ad                   = "0001020304050607",
    .p_nonce                = "c34791ac7cc811e6d6642a7274",
    .p_mac                  = "b9f4e4d93b978141"
};

// AES CCM - Custom test vector 6 - Invalid behavior test for AES nonce.
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_ccm_256_inv_c23) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 256 Encrypt with invalid AES nonce",
    .p_plaintext            = "08090a0b0c0d0e0f101112131415161718191a1b1c1d1e",
    .p_ciphertext           = "b7877d560c6f604032ff9a67b99a8ca3697a76ee40bc73",
    .p_key                  = "4a44110f37e0f8761aa1adc2eeae1c741568036b7eb3b3b8a7ae8ea41a353f5b",
    .p_ad                   = "0001020304050607",
    .p_nonce                = "d34791ac7cc811e6d6642a7274",
    .p_mac                  = "b9f4e4d93b978141"
};

// AES CCM - Custom test vector 7 - Invalid behavior test for AES nonce.
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_ccm_256_inv_c24) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 256 Decrypt with invalid AES nonce",
    .p_plaintext            = "08090a0b0c0d0e0f101112131415161718191a1b1c1d1e",
    .p_ciphertext           = "b7877d560c6f604032ff9a67b99a8ca3697a76ee40bc73",
    .p_key                  = "4a44110f37e0f8761aa1adc2eeae1c741568036b7eb3b3b8a7ae8ea41a353f5b",
    .p_ad                   = "0001020304050607",
    .p_nonce                = "d34791ac7cc811e6d6642a7274",
    .p_mac                  = "b9f4e4d93b978141"
};

// AES CCM - Custom test vector 8
NRF_SECTION_ITEM_REGISTER(test_vector_aead_data, test_vector_aead_t test_vector_aes_ccm_256_c8) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 256 message_len=250 ad_len=8 mac_len=8",
    .p_plaintext            = "e96325847ce207c2bf6638a52634075139998888fa0ca1501a4b57ee0767210f1fee065b7ed1e4005fe1c3ec482b2d3cad3d8461d4ab2ba1c73cbe2c65ac8b1e61be3f052ecadf671a3f58601ec0f1ac95367dae85601449f434b9d10757a613784a229aa14bebe6ed07579ec0a513ce7ce799d1e6cd468613f0d3f42e6162680b28f13aeb826572934424459137bd3aabec437bf4fdff007d2675d7fd2195280da092eb1b3549e5457e065cc47349f2c3013b8a4a1938b05c033b2a5b6b477be39b415f4f50beac41f817783bda28f24bab3c8095e1b01e48ce4271cd2a323d1d8c100bb9856f75f63bdee34510de01e32efc0b12e980e9161a",
    .p_ciphertext           = "9149b2ed37d55b4624bbffc5cefdd81e4def4846e37b36145a9ee65fd5ab6d5257cf45b9e820d398e2eca51187edf2fedc77f261ef7c9ce9ba32dfcb512dc7d5b02e8cea52a05fbe67494305e5db19d522a3654f368f916c249c0d969b04532c1b07cba06274b031c8b99127c01b8743c2c0edc199805059942bc29fa2c0fc2a038714bee5e59c3f0e7fd5fbceaedd06e3d8eb464cf13a4897a57d1898578ac743263ab3c75ba456f0f5a39d874d369060c316c931901714451715648459a4b171fe3ab6092a06da3a4d34c6cf8311dc27276d6093a886a3cb05259f7e2cb11f73d4eb8c567a9867111c8f49a8a172bc8bc4f1df4180ed1a2db0",
    .p_key                  = "b64736f19c3e10324637ccb90c4558170a0dc151a2d9769c686438e55fb78e7e",
    .p_ad                   = "4bf9a35147f3b430",
    .p_nonce                = "43925318850a09c9fb23247cbd",
    .p_mac                  = "a74563df99af87f2"
};

// AES CCM - Custom test vector 9
NRF_SECTION_ITEM_REGISTER(test_vector_aead_data, test_vector_aead_t test_vector_aes_ccm_256_c9) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 256 message_len=16 ad_len=250 mac_len=8 nonce_len=13",
    .p_plaintext            = "08090a0b0c0d0e0f101112131415161718191a1b1c1d1e",
    .p_ciphertext           = "70239d62473a528b8bccd573fcdcc9586c6fdad5056a89",
    .p_key                  = "b64736f19c3e10324637ccb90c4558170a0dc151a2d9769c686438e55fb78e7e",
    .p_ad                   = "0ee0089ec32c7cfa036bd1ab9c23b98cd5d166214d61c719688c6a0ecff705da47ac179cae7eaa3b638ab022a6669729fe47f24679e78488125d989cc7d1bbd8b472b04678b45adde4cca92cd91c4e214257243b163eca04bf643e9df6f7c5bf55aa91bc348154b5c3e9529a56fed8b04e0726b6de3ecc43f499108933e07297bdfcd4d8df2aa9af908083aeccc5c23fe9efbbf5fa9a27ea2923d36188197c87c955fcc5f7e0ebff4b01ebf008a5c93dab12ddfbf65f4225e5a3dfd44e36dbc3ba7891fce514d127e5eb8adb939670b4c5643c46425c614546b90cf0d720203bef4a12ff2d766623c92e134420e3b423b526598f32e8884843bc",
    .p_nonce                = "43925318850a09c9fb23247cbd",
    .p_mac                  = "515280d5ec0db1c4"
};


