OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0_59ac345/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_aead_ccm.c
// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 256 - Count 60
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_encrypt60) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 256 Encrypt message_len=24 ad_len=0 mac_len=4 nonce_len=7 valid 1",
    .p_plaintext            = "d3d5424e20fbec43ae495353ed830271515ab104f8860c98",
    .p_ciphertext           = "64a1341679972dc5869fcf69b19d5c5ea50aa0b5e985f5b7",
    .p_key                  = "af063639e66c284083c5cf72b70d8bc277f5978e80d9322d99f2fdc718cda569",
    .p_ad                   = "",
    .p_nonce                = "a544218dadd3c1",
    .p_mac                  = "22aa8d59"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 256 - Count 61
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_encrypt61) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 256 Encrypt message_len=24 ad_len=0 mac_len=4 nonce_len=7 invalid 1",
    .p_plaintext            = "d3d5424e20fbec43ae495353ed830271515ab104f8860c98",
    .p_ciphertext           = "c5b7f802bffc498c1626e3774f1d9f94045dfd8e1a10a202",
    .p_key                  = "af063639e66c284083c5cf72b70d8bc277f5978e80d9322d99f2fdc718cda569",
    .p_ad                   = "",
    .p_nonce                = "bfcda8b5a2d0d2",
    .p_mac                  = "77d00a75"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 256 - Count 62
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_encrypt62) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 256 Encrypt message_len=24 ad_len=0 mac_len=4 nonce_len=7 invalid 2",
    .p_plaintext            = "d3d5424e20fbec43ae495353ed830271515ab104f8860c98",
    .p_ciphertext           = "bf432e246b7fa4aff8b3ada738432b51f6872ed92284db9d",
    .p_key                  = "af063639e66c284083c5cf72b70d8bc277f5978e80d9322d99f2fdc718cda569",
    .p_ad                   = "",
    .p_nonce                = "6bae7f35c56b27",
    .p_mac                  = "28588021"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 256 - Count 75
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_encrypt75) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 256 Encrypt message_len=24 ad_len=0 mac_len=16 nonce_len=7 valid 1",
    .p_plaintext            = "d3d5424e20fbec43ae495353ed830271515ab104f8860c98",
    .p_ciphertext           = "bc51c3925a960e7732533e4ef3a4f69ee6826de952bcb0fd",
    .p_key                  = "f7079dfa3b5c7b056347d7e437bcded683abd6e2c9e069d333284082cbb5d453",
    .p_ad                   = "",
    .p_nonce                = "a544218dadd3c1",
    .p_mac                  = "374f3bb6db8377ebfc79674858c4f305"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 256 - Count 76
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_encrypt76) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 256 Encrypt message_len=24 ad_len=0 mac_len=16 nonce_len=7 invalid 1",
    .p_plaintext            = "d3d5424e20fbec43ae495353ed830271515ab104f8860c98",
    .p_ciphertext           = "afa1fa8e8a70e26b02161150556d604101fdf423f332c336",
    .p_key                  = "f7079dfa3b5c7b056347d7e437bcded683abd6e2c9e069d333284082cbb5d453",
    .p_ad                   = "",
    .p_nonce                = "bfcda8b5a2d0d2",
    .p_mac                  = "3275f2a4907d51b734fe7238cebbd48f"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 256 - Count 77
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_encrypt77) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 256 Encrypt message_len=24 ad_len=0 mac_len=16 nonce_len=7 invalid 2",
    .p_plaintext            = "d3d5424e20fbec43ae495353ed830271515ab104f8860c98",
    .p_ciphertext           = "72bc8ef21a847047091b673ccf231d35ecf6f4049741703b",
    .p_key                  = "f7079dfa3b5c7b056347d7e437bcded683abd6e2c9e069d333284082cbb5d453",
    .p_ad                   = "",
    .p_nonce                = "6bae7f35c56b27",
    .p_mac                  = "e672f1f22cbe4a5305f19aaa6967237b"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 256 - Count 120
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_encrypt120) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 256 Encrypt message_len=0 ad_len=32 mac_len=4 nonce_len=7 valid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "1b0e8df63c57f05d9ac457575ea764524b8610ae5164e6215f426f5a7ae6ede4",
    .p_ad                   = "d3d5424e20fbec43ae495353ed830271515ab104f8860c988d15b6d36c038eab",
    .p_nonce                = "a544218dadd3c1",
    .p_mac                  = "92d00fbe"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 256 - Count 121
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_encrypt121) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 256 Encrypt message_len=0 ad_len=32 mac_len=4 nonce_len=7 invalid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "1b0e8df63c57f05d9ac457575ea764524b8610ae5164e6215f426f5a7ae6ede4",
    .p_ad                   = "232e957c65ffa11988e830d4617d500f1c4a35c1221f396c41ab214f074ca2dc",
    .p_nonce                = "78c46e3249ca28",
    .p_mac                  = "9143e5c4"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 256 - Count 122
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_encrypt122) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 256 Encrypt message_len=0 ad_len=32 mac_len=4 nonce_len=7 invalid 2",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "1b0e8df63c57f05d9ac457575ea764524b8610ae5164e6215f426f5a7ae6ede4",
    .p_ad                   = "0d40324aa758dbbb5391b5e6edb8a2310c94a4ae51d4fba8a7458d7cc8488baa",
    .p_nonce                = "c18d9e7971e2ae",
    .p_mac                  = "54337466"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 256 - Count 135
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_encrypt135) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 256 Encrypt message_len=0 ad_len=32 mac_len=16 nonce_len=7 valid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "a4bc10b1a62c96d459fbaf3a5aa3face7313bb9e1253e696f96a7a8e36801088",
    .p_ad                   = "d3d5424e20fbec43ae495353ed830271515ab104f8860c988d15b6d36c038eab",
    .p_nonce                = "a544218dadd3c1",
    .p_mac                  = "93af11a08379eb37a16aa2837f09d69d"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 256 - Count 136
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_encrypt136) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 256 Encrypt message_len=0 ad_len=32 mac_len=16 nonce_len=7 invalid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "a4bc10b1a62c96d459fbaf3a5aa3face7313bb9e1253e696f96a7a8e36801088",
    .p_ad                   = "232e957c65ffa11988e830d4617d500f1c4a35c1221f396c41ab214f074ca2dc",
    .p_nonce                = "78c46e3249ca28",
    .p_mac                  = "d19b0c14ec686a7961ca7c386d125a65"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 256 - Count 137
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_encrypt137) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 256 Encrypt message_len=0 ad_len=32 mac_len=16 nonce_len=7 invalid 2",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "a4bc10b1a62c96d459fbaf3a5aa3face7313bb9e1253e696f96a7a8e36801088",
    .p_ad                   = "0d40324aa758dbbb5391b5e6edb8a2310c94a4ae51d4fba8a7458d7cc8488baa",
    .p_nonce                = "c18d9e7971e2ae",
    .p_mac                  = "02ea916d60e2ceec6d9dc9b1185569b3"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 256 - Count 180
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_encrypt180) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 256 Encrypt message_len=24 ad_len=32 mac_len=4 nonce_len=7 valid 1",
    .p_plaintext            = "78c46e3249ca28e1ef0531d80fd37c124d9aecb7be6668e3",
    .p_ciphertext           = "c2fe12658139f5d0dd22cadf2e901695b579302a72fc5608",
    .p_key                  = "8c5cf3457ff22228c39c051c4e05ed4093657eb303f859a9d4b0f8be0127d88a",
    .p_ad                   = "d3d5424e20fbec43ae495353ed830271515ab104f8860c988d15b6d36c038eab",
    .p_nonce                = "a544218dadd3c1",
    .p_mac                  = "3ebc7720"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 256 - Count 181
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_encrypt181) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 256 Encrypt message_len=24 ad_len=32 mac_len=4 nonce_len=7 invalid 1",
    .p_plaintext            = "78c46e3249ca28e1ef0531d80fd37c124d9aecb7be6668e3",
    .p_ciphertext           = "94748ba81229e53c38583a8564b23ebbafc6f6efdf4c2a81",
    .p_key                  = "8c5cf3457ff22228c39c051c4e05ed4093657eb303f859a9d4b0f8be0127d88a",
    .p_ad                   = "5a053b2a1bb87e85d56527bfcdcd3ecafb991bb10e4c862bb0751c700a29f54b",
    .p_nonce                = "6ba004fd176791",
    .p_mac                  = "c44db2c9"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 256 - Count 182
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_encrypt182) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 256 Encrypt message_len=24 ad_len=32 mac_len=4 nonce_len=7 invalid 2",
    .p_plaintext            = "78c46e3249ca28e1ef0531d80fd37c124d9aecb7be6668e3",
    .p_ciphertext           = "1d670ccf3e9ba59186c48da2e5bd0ab21973eee2ea2985bf",
    .p_key                  = "8c5cf3457ff22228c39c051c4e05ed4093657eb303f859a9d4b0f8be0127d88a",
    .p_ad                   = "8f01a61eb17366d4e70942ab69b4f4bcf8ff6a97f5972ee5780a264c9dcf7d93",
    .p_nonce                = "45c5c284836414",
    .p_mac                  = "83a09067"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 256 - Count 195
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_encrypt195) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 256 Encrypt message_len=24 ad_len=32 mac_len=16 nonce_len=7 valid 1",
    .p_plaintext            = "78c46e3249ca28e1ef0531d80fd37c124d9aecb7be6668e3",
    .p_ciphertext           = "3341168eb8c48468c414347fb08f71d2086f7c2d1bd581ce",
    .p_key                  = "705334e30f53dd2f92d190d2c1437c8772f940c55aa35e562214ed45bd458ffe",
    .p_ad                   = "d3d5424e20fbec43ae495353ed830271515ab104f8860c988d15b6d36c038eab",
    .p_nonce                = "a544218dadd3c1",
    .p_mac                  = "1ac68bd42f5ec7fa7e068cc0ecd79c2a"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 256 - Count 196
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_encrypt196) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 256 Encrypt message_len=24 ad_len=32 mac_len=16 nonce_len=7 invalid 1",
    .p_plaintext            = "78c46e3249ca28e1ef0531d80fd37c124d9aecb7be6668e3",
    .p_ciphertext           = "d543acda712b898cbb27b8f598b2e4438ce587a836e27851",
    .p_key                  = "705334e30f53dd2f92d190d2c1437c8772f940c55aa35e562214ed45bd458ffe",
    .p_ad                   = "5a053b2a1bb87e85d56527bfcdcd3ecafb991bb10e4c862bb0751c700a29f54b",
    .p_nonce                = "6ba004fd176791",
    .p_mac                  = "47c3338a2400809e739b63ba8227d2f9"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 256 - Count 197
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_encrypt197) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 256 Encrypt message_len=24 ad_len=32 mac_len=16 nonce_len=7 invalid 2",
    .p_plaintext            = "78c46e3249ca28e1ef0531d80fd37c124d9aecb7be6668e3",
    .p_ciphertext           = "39a8af5c976b995ea8049e55b68bc65503592ab009156386",
    .p_key                  = "705334e30f53dd2f92d190d2c1437c8772f940c55aa35e562214ed45bd458ffe",
    .p_ad                   = "8f01a61eb17366d4e70942ab69b4f4bcf8ff6a97f5972ee5780a264c9dcf7d93",
    .p_nonce                = "45c5c284836414",
    .p_mac                  = "46288ce9dd1c7088c752e35947fdca98"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 256 - Count 210
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_encrypt210) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 256 Encrypt message_len=24 ad_len=32 mac_len=4 nonce_len=13 valid 1",
    .p_plaintext            = "e8de970f6ee8e80ede933581b5bcf4d837e2b72baa8b00c3",
    .p_ciphertext           = "c0ea400b599561e7905b99262b4565d5c3dc49fad84d7c69",
    .p_key                  = "705334e30f53dd2f92d190d2c1437c8772f940c55aa35e562214ed45bd458ffe",
    .p_ad                   = "3c0e2815d37d844f7ac240ba9d6e3a0b2a86f706e885959e09a1005e024f6907",
    .p_nonce                = "a544218dadd3c10583db49cf39",
    .p_mac                  = "ef891339"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 256 - Count 211
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_encrypt211) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 256 Encrypt message_len=24 ad_len=32 mac_len=4 nonce_len=13 invalid 1",
    .p_plaintext            = "e8de970f6ee8e80ede933581b5bcf4d837e2b72baa8b00c3",
    .p_ciphertext           = "60871e03ea0eb968536c99f926ea24ef43d41272ad9fb7f6",
    .p_key                  = "705334e30f53dd2f92d190d2c1437c8772f940c55aa35e562214ed45bd458ffe",
    .p_ad                   = "5bb40e3bb72b4509324a7edc852f72535f1f6283156e63f6959ffaf39dcde800",
    .p_nonce                = "8fa501c5dd9ac9b868144c9fa5",
    .p_mac                  = "3d488623"
};

// AES CCM - NIST CAVS 11.1 DVPT Encrypt with keysize 256 - Count 212
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_encrypt212) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "CCM 256 Encrypt message_len=24 ad_len=32 mac_len=4 nonce_len=13 invalid 2",
    .p_plaintext            = "e8de970f6ee8e80ede933581b5bcf4d837e2b72baa8b00c3",
    .p_ciphertext           = "81d7859dcbe51dcc94fe2591cd3b0540003d49a8c4dccbf4",
    .p_key                  = "705334e30f53dd2f92d190d2c1437c8772f940c55aa35e562214ed45bd458ffe",
    .p_ad                   = "07203674260208d5bd4d39506836f7e76ffc58e938799f21aff7bb4dea4410d2",
    .p_nonce                = "9bc0d1502a47e46350fe8667ca",
    .p_mac                  = "527e5ed0"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 256 - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_decrypt0) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 256 Decrypt message_len=0 ad_len=0 mac_len=4 nonce_len=7 valid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "eda32f751456e33195f1f499cf2dc7c97ea127b6d488f211ccc5126fbb24afa6",
    .p_ad                   = "",
    .p_nonce                = "a544218dadd3c1",
    .p_mac                  = "469c90bb"
};

