OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0_59ac345/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_aead_ccm.c
// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 256 - Count 46
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_decrypt46) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 256 Decrypt message_len=0 ad_len=0 mac_len=16 nonce_len=13 invalid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "af063639e66c284083c5cf72b70d8bc277f5978e80d9322d99f2fdc718cda569",
    .p_ad                   = "",
    .p_nonce                = "3c0e2815d37d844f7ac240ba9d",
    .p_mac                  = "5a9596c511ea6a8671adefc4f2157d8b"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 256 - Count 47
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_decrypt47) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 256 Decrypt message_len=0 ad_len=0 mac_len=16 nonce_len=13 invalid 2",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "af063639e66c284083c5cf72b70d8bc277f5978e80d9322d99f2fdc718cda569",
    .p_ad                   = "",
    .p_nonce                = "75549e7e5657e5fe19872fcee0",
    .p_mac                  = "66f5c53efbc74fa02dedc303fd95133a"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 256 - Count 60
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_decrypt60) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 256 Decrypt message_len=24 ad_len=0 mac_len=4 nonce_len=7 valid 1",
    .p_plaintext            = "d3d5424e20fbec43ae495353ed830271515ab104f8860c98",
    .p_ciphertext           = "64a1341679972dc5869fcf69b19d5c5ea50aa0b5e985f5b7",
    .p_key                  = "af063639e66c284083c5cf72b70d8bc277f5978e80d9322d99f2fdc718cda569",
    .p_ad                   = "",
    .p_nonce                = "a544218dadd3c1",
    .p_mac                  = "22aa8d59"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 256 - Count 61
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_decrypt61) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 256 Decrypt message_len=24 ad_len=0 mac_len=4 nonce_len=7 invalid 1",
    .p_plaintext            = "d3d5424e20fbec43ae495353ed830271515ab104f8860c98",
    .p_ciphertext           = "c5b7f802bffc498c1626e3774f1d9f94045dfd8e1a10a202",
    .p_key                  = "af063639e66c284083c5cf72b70d8bc277f5978e80d9322d99f2fdc718cda569",
    .p_ad                   = "",
    .p_nonce                = "bfcda8b5a2d0d2",
    .p_mac                  = "77d00a75"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 256 - Count 62
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_decrypt62) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 256 Decrypt message_len=24 ad_len=0 mac_len=4 nonce_len=7 invalid 2",
    .p_plaintext            = "d3d5424e20fbec43ae495353ed830271515ab104f8860c98",
    .p_ciphertext           = "bf432e246b7fa4aff8b3ada738432b51f6872ed92284db9d",
    .p_key                  = "af063639e66c284083c5cf72b70d8bc277f5978e80d9322d99f2fdc718cda569",
    .p_ad                   = "",
    .p_nonce                = "6bae7f35c56b27",
    .p_mac                  = "28588021"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 256 - Count 75
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_decrypt75) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 256 Decrypt message_len=24 ad_len=0 mac_len=16 nonce_len=7 valid 1",
    .p_plaintext            = "d3d5424e20fbec43ae495353ed830271515ab104f8860c98",
    .p_ciphertext           = "bc51c3925a960e7732533e4ef3a4f69ee6826de952bcb0fd",
    .p_key                  = "f7079dfa3b5c7b056347d7e437bcded683abd6e2c9e069d333284082cbb5d453",
    .p_ad                   = "",
    .p_nonce                = "a544218dadd3c1",
    .p_mac                  = "374f3bb6db8377ebfc79674858c4f305"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 256 - Count 76
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_decrypt76) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 256 Decrypt message_len=24 ad_len=0 mac_len=16 nonce_len=7 invalid 1",
    .p_plaintext            = "d3d5424e20fbec43ae495353ed830271515ab104f8860c98",
    .p_ciphertext           = "afa1fa8e8a70e26b02161150556d604101fdf423f332c336",
    .p_key                  = "f7079dfa3b5c7b056347d7e437bcded683abd6e2c9e069d333284082cbb5d453",
    .p_ad                   = "",
    .p_nonce                = "bfcda8b5a2d0d2",
    .p_mac                  = "3275f2a4907d51b734fe7238cebbd48f"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 256 - Count 77
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_decrypt77) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 256 Decrypt message_len=24 ad_len=0 mac_len=16 nonce_len=7 invalid 2",
    .p_plaintext            = "d3d5424e20fbec43ae495353ed830271515ab104f8860c98",
    .p_ciphertext           = "72bc8ef21a847047091b673ccf231d35ecf6f4049741703b",
    .p_key                  = "f7079dfa3b5c7b056347d7e437bcded683abd6e2c9e069d333284082cbb5d453",
    .p_ad                   = "",
    .p_nonce                = "6bae7f35c56b27",
    .p_mac                  = "e672f1f22cbe4a5305f19aaa6967237b"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 256 - Count 120
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_decrypt120) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 256 Decrypt message_len=0 ad_len=32 mac_len=4 nonce_len=7 valid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "1b0e8df63c57f05d9ac457575ea764524b8610ae5164e6215f426f5a7ae6ede4",
    .p_ad                   = "d3d5424e20fbec43ae495353ed830271515ab104f8860c988d15b6d36c038eab",
    .p_nonce                = "a544218dadd3c1",
    .p_mac                  = "92d00fbe"
};

