OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0_59ac345/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_aead_ccm.c
// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 256 - Count 121
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_decrypt121) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 256 Decrypt message_len=0 ad_len=32 mac_len=4 nonce_len=7 invalid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "1b0e8df63c57f05d9ac457575ea764524b8610ae5164e6215f426f5a7ae6ede4",
    .p_ad                   = "232e957c65ffa11988e830d4617d500f1c4a35c1221f396c41ab214f074ca2dc",
    .p_nonce                = "78c46e3249ca28",
    .p_mac                  = "9143e5c4"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 256 - Count 122
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_decrypt122) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 256 Decrypt message_len=0 ad_len=32 mac_len=4 nonce_len=7 invalid 2",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "1b0e8df63c57f05d9ac457575ea764524b8610ae5164e6215f426f5a7ae6ede4",
    .p_ad                   = "0d40324aa758dbbb5391b5e6edb8a2310c94a4ae51d4fba8a7458d7cc8488baa",
    .p_nonce                = "c18d9e7971e2ae",
    .p_mac                  = "54337466"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 256 - Count 135
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_decrypt135) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 256 Decrypt message_len=0 ad_len=32 mac_len=16 nonce_len=7 valid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "a4bc10b1a62c96d459fbaf3a5aa3face7313bb9e1253e696f96a7a8e36801088",
    .p_ad                   = "d3d5424e20fbec43ae495353ed830271515ab104f8860c988d15b6d36c038eab",
    .p_nonce                = "a544218dadd3c1",
    .p_mac                  = "93af11a08379eb37a16aa2837f09d69d"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 256 - Count 136
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_decrypt136) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 256 Decrypt message_len=0 ad_len=32 mac_len=16 nonce_len=7 invalid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "a4bc10b1a62c96d459fbaf3a5aa3face7313bb9e1253e696f96a7a8e36801088",
    .p_ad                   = "232e957c65ffa11988e830d4617d500f1c4a35c1221f396c41ab214f074ca2dc",
    .p_nonce                = "78c46e3249ca28",
    .p_mac                  = "d19b0c14ec686a7961ca7c386d125a65"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 256 - Count 137
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_decrypt137) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 256 Decrypt message_len=0 ad_len=32 mac_len=16 nonce_len=7 invalid 2",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "a4bc10b1a62c96d459fbaf3a5aa3face7313bb9e1253e696f96a7a8e36801088",
    .p_ad                   = "0d40324aa758dbbb5391b5e6edb8a2310c94a4ae51d4fba8a7458d7cc8488baa",
    .p_nonce                = "c18d9e7971e2ae",
    .p_mac                  = "02ea916d60e2ceec6d9dc9b1185569b3"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 256 - Count 180
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_decrypt180) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 256 Decrypt message_len=24 ad_len=32 mac_len=4 nonce_len=7 valid 1",
    .p_plaintext            = "78c46e3249ca28e1ef0531d80fd37c124d9aecb7be6668e3",
    .p_ciphertext           = "c2fe12658139f5d0dd22cadf2e901695b579302a72fc5608",
    .p_key                  = "8c5cf3457ff22228c39c051c4e05ed4093657eb303f859a9d4b0f8be0127d88a",
    .p_ad                   = "d3d5424e20fbec43ae495353ed830271515ab104f8860c988d15b6d36c038eab",
    .p_nonce                = "a544218dadd3c1",
    .p_mac                  = "3ebc7720"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 256 - Count 181
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_decrypt181) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 256 Decrypt message_len=24 ad_len=32 mac_len=4 nonce_len=7 invalid 1",
    .p_plaintext            = "78c46e3249ca28e1ef0531d80fd37c124d9aecb7be6668e3",
    .p_ciphertext           = "94748ba81229e53c38583a8564b23ebbafc6f6efdf4c2a81",
    .p_key                  = "8c5cf3457ff22228c39c051c4e05ed4093657eb303f859a9d4b0f8be0127d88a",
    .p_ad                   = "5a053b2a1bb87e85d56527bfcdcd3ecafb991bb10e4c862bb0751c700a29f54b",
    .p_nonce                = "6ba004fd176791",
    .p_mac                  = "c44db2c9"
};

