OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0_59ac345/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_aead_ccm.c
// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 256 - Count 182
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_decrypt182) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 256 Decrypt message_len=24 ad_len=32 mac_len=4 nonce_len=7 invalid 2",
    .p_plaintext            = "78c46e3249ca28e1ef0531d80fd37c124d9aecb7be6668e3",
    .p_ciphertext           = "1d670ccf3e9ba59186c48da2e5bd0ab21973eee2ea2985bf",
    .p_key                  = "8c5cf3457ff22228c39c051c4e05ed4093657eb303f859a9d4b0f8be0127d88a",
    .p_ad                   = "8f01a61eb17366d4e70942ab69b4f4bcf8ff6a97f5972ee5780a264c9dcf7d93",
    .p_nonce                = "45c5c284836414",
    .p_mac                  = "83a09067"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 256 - Count 195
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_decrypt195) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 256 Decrypt message_len=24 ad_len=32 mac_len=16 nonce_len=7 valid 1",
    .p_plaintext            = "78c46e3249ca28e1ef0531d80fd37c124d9aecb7be6668e3",
    .p_ciphertext           = "3341168eb8c48468c414347fb08f71d2086f7c2d1bd581ce",
    .p_key                  = "705334e30f53dd2f92d190d2c1437c8772f940c55aa35e562214ed45bd458ffe",
    .p_ad                   = "d3d5424e20fbec43ae495353ed830271515ab104f8860c988d15b6d36c038eab",
    .p_nonce                = "a544218dadd3c1",
    .p_mac                  = "1ac68bd42f5ec7fa7e068cc0ecd79c2a"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 256 - Count 196
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_decrypt196) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 256 Decrypt message_len=24 ad_len=32 mac_len=16 nonce_len=7 invalid 1",
    .p_plaintext            = "78c46e3249ca28e1ef0531d80fd37c124d9aecb7be6668e3",
    .p_ciphertext           = "d543acda712b898cbb27b8f598b2e4438ce587a836e27851",
    .p_key                  = "705334e30f53dd2f92d190d2c1437c8772f940c55aa35e562214ed45bd458ffe",
    .p_ad                   = "5a053b2a1bb87e85d56527bfcdcd3ecafb991bb10e4c862bb0751c700a29f54b",
    .p_nonce                = "6ba004fd176791",
    .p_mac                  = "47c3338a2400809e739b63ba8227d2f9"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 256 - Count 197
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_decrypt197) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 256 Decrypt message_len=24 ad_len=32 mac_len=16 nonce_len=7 invalid 2",
    .p_plaintext            = "78c46e3249ca28e1ef0531d80fd37c124d9aecb7be6668e3",
    .p_ciphertext           = "39a8af5c976b995ea8049e55b68bc65503592ab009156386",
    .p_key                  = "705334e30f53dd2f92d190d2c1437c8772f940c55aa35e562214ed45bd458ffe",
    .p_ad                   = "8f01a61eb17366d4e70942ab69b4f4bcf8ff6a97f5972ee5780a264c9dcf7d93",
    .p_nonce                = "45c5c284836414",
    .p_mac                  = "46288ce9dd1c7088c752e35947fdca98"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 256 - Count 210
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_decrypt210) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 256 Decrypt message_len=24 ad_len=32 mac_len=4 nonce_len=13 valid 1",
    .p_plaintext            = "e8de970f6ee8e80ede933581b5bcf4d837e2b72baa8b00c3",
    .p_ciphertext           = "c0ea400b599561e7905b99262b4565d5c3dc49fad84d7c69",
    .p_key                  = "705334e30f53dd2f92d190d2c1437c8772f940c55aa35e562214ed45bd458ffe",
    .p_ad                   = "3c0e2815d37d844f7ac240ba9d6e3a0b2a86f706e885959e09a1005e024f6907",
    .p_nonce                = "a544218dadd3c10583db49cf39",
    .p_mac                  = "ef891339"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 256 - Count 211
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_decrypt211) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 256 Decrypt message_len=24 ad_len=32 mac_len=4 nonce_len=13 invalid 1",
    .p_plaintext            = "e8de970f6ee8e80ede933581b5bcf4d837e2b72baa8b00c3",
    .p_ciphertext           = "60871e03ea0eb968536c99f926ea24ef43d41272ad9fb7f6",
    .p_key                  = "705334e30f53dd2f92d190d2c1437c8772f940c55aa35e562214ed45bd458ffe",
    .p_ad                   = "5bb40e3bb72b4509324a7edc852f72535f1f6283156e63f6959ffaf39dcde800",
    .p_nonce                = "8fa501c5dd9ac9b868144c9fa5",
    .p_mac                  = "3d488623"
};

// AES CCM - NIST CAVS 11.1 DVPT Decrypt with keysize 256 - Count 212
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_ccm_256_decrypt212) =
{
    .p_aead_info            = &g_nrf_crypto_aes_ccm_256_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "CCM 256 Decrypt message_len=24 ad_len=32 mac_len=4 nonce_len=13 invalid 2",
    .p_plaintext            = "e8de970f6ee8e80ede933581b5bcf4d837e2b72baa8b00c3",
    .p_ciphertext           = "81d7859dcbe51dcc94fe2591cd3b0540003d49a8c4dccbf4",
    .p_key                  = "705334e30f53dd2f92d190d2c1437c8772f940c55aa35e562214ed45bd458ffe",
    .p_ad                   = "07203674260208d5bd4d39506836f7e76ffc58e938799f21aff7bb4dea4410d2",
    .p_nonce                = "9bc0d1502a47e46350fe8667ca",
    .p_mac                  = "527e5ed0"
};

#endif // NRF_MODULE_ENABLED(NRF_CRYPTO_AES_CCM_256)

/*lint -restore */

#endif // NRF_MODULE_ENABLED(NRF_CRYPTO_AES_CCM)
